Example-theme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-14 Tue 13:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Document Title</title>
<meta name="author" content="Nomen Nescio" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="/home/karthik/mynotes/org2html/org-theme-collection/readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/home/karthik/mynotes/org2html/org-theme-collection/readtheorg.css"/>
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="/home/karthik/mynotes/org2html/org-theme-collection/readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/home/karthik/mynotes/org2html/org-theme-collection/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Document Title</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5fde040">Doc Header or Meta data</a></li>
<li><a href="#org20f4a71">Image section</a></li>
<li><a href="#org445592d">Conf Text Mode in Org Mode</a></li>
</ul>
</div>
</div>
<p>
source : <a href="https://lucidmanager.org/productivity/emacs-for-distraction-free-writing/">https://lucidmanager.org/productivity/emacs-for-distraction-free-writing/</a> <br />
source : <a href="https://lucidmanager.org/productivity/ricing-org-mode/">https://lucidmanager.org/productivity/ricing-org-mode/</a> <br />
</p>

<p>
source menu : <a href="https://lucidmanager.org/productivity/more-productive-with-emacs/">https://lucidmanager.org/productivity/more-productive-with-emacs/</a>
</p>
<div id="outline-container-org5fde040" class="outline-2">
<h2 id="org5fde040">Doc Header or Meta data</h2>
<div class="outline-text-2" id="text-org5fde040">
<p>
Each Org document starts with a header that contains metadata and settings relevant for the buffer.<br />
You need to at least provide a document title. <br />
The Org mode metadata and settings always start with #+ followed by a keyword and a colon. <br />
The example below ads a title and startup variables explained below. <br />
The document header can also contain metadata such as a subtitle or a date. <br />
Emacs packages can use this information when exporting the text.
</p>
<blockquote>
<p>
+title: Document Title <br />
+startup: num indent inlineimages <br />
+author: Nomen Nescio <br />
+date: <span class="timestamp-wrapper"><span class="timestamp">[2021-05-08 Sat] </span></span> <br />
</p>
</blockquote>
</div>
</div>




<div id="outline-container-org20f4a71" class="outline-2">
<h2 id="org20f4a71">Image section</h2>
<div class="outline-text-2" id="text-org20f4a71">
<p alt="Alternative text">
<a href="path/to/image" alt="Alternative text">path/to/image</a> <br />
If you use the Helm completion system, you can preview the image as you select it with helm-follow-mode. When you are in the Helm selection session, toggle follow mode with C-c C-f. As you move the cursor, images will appear in anoter window. <br />
To view the preview images in your document or remove the previews, you press C-c C-x C-v. You can also add #+startup: inlineimages to view images by default. <br />
To add an image, press C-c C-l, which opens the link menu. Org mode understands many types of links. We want the file type, so type file:. Press enter and select the image filename in the mini buffer. You can skip the file part with the C-u C-c C-l shortcut (adding C-u before the standard shortcut.) <br />
After you enter the image, you preview it with the org-redisplay-inline-images function or C-c C-x C-M-v. <br />
You open a link in Org mode with a mouse click or by pressing C-c C-o with your cursor on the link text. <br />
The images in the buffer are all shown at the same width. The article about writing articles and books with Emacs and the article about creating websites with Emacs explains how to control image with and other image properties. <br />
You can increase or decrease the size of an image with the + and - keys.<br />
</p>
</div>
</div>



<div id="outline-container-org445592d" class="outline-2">
<h2 id="org445592d">Conf Text Mode in Org Mode</h2>
<div class="outline-text-2" id="text-org445592d">
<p>
The original purpose of Emacs is to develop computer code, so by default, the editor does not wrap lines at the end of the screen. While this might be great for developing software, it is a bit annoying when writing prose. The visual-line-mode function enables line-wrapping. You can run the function separately for each buffer, but ideally, you hook it to all text modes.
When you select (mark) a section of text and start typing, Emacs will not replace the selected text. To enable Emacs deleting selected text, you set the delete-selection-mode variable, as below.
One last sensible default is to enure that Emacs lets you use the page-up and page-down buttons to go to the first and last line in the buffer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Sensible line breaking</span>
<span style="color: #3a81c3;">(</span>add-hook 'text-mode-hook 'visual-line-mode<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Overwrite selected text</span>
<span style="color: #3a81c3;">(</span>delete-selection-mode t<span style="color: #3a81c3;">)</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Scroll to the first and last line of the buffer</span>
<span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">setq</span> scroll-error-top-bottom t<span style="color: #3a81c3;">)</span>

</pre>
</div>

<p>
The code snippet below sets some common keyboard shortcuts for creating links, viewing the agenda and capturing note, which are explained in other articles. You will also need to install use-package, which is explained article on how to configure Emacs.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #2aa1ae; background-color: #ecf3ec;">;; </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Org-Mode initial setup</span>
  <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">use-package</span> <span style="color: #4e3163;">org</span>
    <span style="color: #3a81c3;">:bind</span>
    <span style="color: #6c3163;">(</span><span style="color: #2d9574;">(</span><span style="color: #2d9574;">"C-c l"</span> . org-store-link<span style="color: #2d9574;">)</span>
     <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"C-c a"</span> . org-agenda<span style="color: #2d9574;">)</span>
     <span style="color: #2d9574;">(</span><span style="color: #2d9574;">"C-c c"</span> . org-capture<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>


<span style="color: #3a81c3;">(</span>org-bable-tangle<span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span>org-bable-tangle-file <span style="color: #2d9574;">"~/.emacs.d/myinit.org"</span><span style="color: #3a81c3;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-05-08 Sat 00:00</p>
<p class="author">Author: Nomen Nescio</p>
<p class="date">Created: 2023-03-14 Tue 13:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
